Revit 2027 API
ReinforcementAbbreviationTag Constructor
 Constructs a new ReinforcementAbbreviationTag.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType typeTag,
	string abbreviationTag
)
Public Sub New (
	typeTag As ReinforcementAbbreviationTagType,
	abbreviationTag As String
)
public:
ReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType typeTag,
	String^ abbreviationTag
)
new :
        typeTag : ReinforcementAbbreviationTagType *
        abbreviationTag : string -> ReinforcementAbbreviationTag
Parameters
typeTag ReinforcementAbbreviationTagType
 Defines the type of abbreviation tag.
abbreviationTag String
 Defines the abbreviation tag value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace